#
#
#  1. print( ) 함수
#     정의:()안에 내용을 콘솔창에 출력
#     사용방법:print("출력할 값")
# 2. .int().str(),float()함수
#     정의:
#       int()= ()안에 수를 정수로 바꾼다
#       str=()= ()안에 수를 문자로 바꾼다
#       float()= ()안에 수를 실수로 바꾼다
#     사용방법:()안에 수를 넣는다
#  3.인덱싱이란
#    정의: 원하는 부분의 문자를 가져오는 것이다
#    사용방법: 문자변수이름[시작값+끝값+간격]
#   4.슬라리싱
#       정의:원하는 부분의 문자를 가져오는 것이다
#       사용방법:문자변수이름[시작값+끝값+간격]
#   5.replace()함수
#       정의:변수 값을 바꾸는 것이다
#       사용방법:변수이름.replace("바꿀값,"바꾼 값")
#   6.split():함수
# 	정의:변수 값은 분리하는 것이다
# 	사용방법:콤마와 공백이 같이 있는 문자열을 분리한다
#
# 7. % formatting 이란
# 문자열 중간 중간에 특정 변수의 값을 넣는다
#
# 8. format( ) 함수
# 	정의:포멧[ ]을 만든다
# 	사용방법:format 함수는 중괄호 {, } 안에 포매팅을 지정하고 format 함수의 인자로 값들을 넣는다
#
#
# 9.f-string
# 	정의:쉽고 간단하게 {%s,%d}를 사용한다
# 	사용방법:{} 안에 들어갈 데이터를 format 함수 안에 넣기
#
#
# 10.strip
# 	정의:양쪽 공백이 사라진다
# 	사용방법: 만약(    ㅇ    )이라면 (ㅇ)으로 만든다
#
# 11.upper( ) lower( ) capiealize ( ) 함수
# 	정의: upper은 다 대문자로 한다, lower은 다 소문자로 한다, capiealize는 앞 글자만 대문자로 한다
# 	사용방법:만약 man이라면 upper은 MAN으로 만들고 lower은 그대로이다 capiealize은 Man으로 만든다
# 12. endswich( ) startswitch( ) 함수
# 	정의:끝나는 문자가 맞는지 확인하는 것, 첫문자가 맞는지 확인하는 함수
# 	사용방법:파일에서"xlsx"로끝나면 트루 아님 퍼스
# 13. 리스트와 변수 차이
# 리스트는 ~~= [ㅇㄻ] 하는 것이고 변수는
# 14. .append( ) insert( ) del 함수
# 	정의:리스의 변수 추가
# 	사용방법:가장 뒤에한다
# 15.max( )	min( ) som( ) len( ) 함수